In [2]:
import numpy as np 
import pandas as pd 
import seaborn as sns 
from scipy.stats import chi2_contingency
ds = sns.load_dataset('titanic')
ds.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
ds.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

# crosstab() fuction or method 
* It shows how many times combinations of values occur.

In [8]:
contangency_table = pd.crosstab(ds['sex'],ds['survived'])
print(contangency_table)

survived    0    1
sex
female     81  233
male      468  109

In [10]:
chi2,p_value,dof,expected = chi2_contingency(contangency_table) # chi2,p_value,
print(expected)

[[193.47474747 120.52525253]
 [355.52525253 221.47474747]]

In [12]:
print(f'{chi2}\n{p_value}\n{dof}')

260.71702016732104
1.1973570627755645e-58
1

In [11]:
alpa = 0.05
if p_value<alpa:
    print('h0 is rejected ')
else:
    print('h0 is acepted ')

h0 is rejected